Masmiseim36/nxpSDK/boards/mimxrt700evk/wifi_examples/wifi_webconfig/cm33_core0/pin_mux.h
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_DRIVE_33OHM  (0x3 << 12) /*!< Selects transmitter current drive 33ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */
#define PDDR_PDD23_pdd1 0x01u             /*!<@brief Port Data Direction: Output */
#define PDDR_PDD7_pdd1 0x01u              /*!<@brief Port Data Direction: Output */
#define PDOR_PDO23_pdo0 0x00u             /*!<@brief Port Data Output: Logic level 0 */
#define PDOR_PDO7_pdo0 0x00u              /*!<@brief Port Data Output: Logic level 0 */

/*! @name PIO7_23 (coord N14), M2_PWREN
  @{ */
/* Routed pin properties */
#define BOARD_INITPINSM2_M2_PWREN_PERIPHERAL GPIO7                   /*!<@brief Peripheral name */
#define BOARD_INITPINSM2_M2_PWREN_SIGNAL IO                          /*!<@brief Signal name */
#define BOARD_INITPINSM2_M2_PWREN_CHANNEL 23                         /*!<@brief Signal channel */
#define BOARD_INITPINSM2_M2_PWREN_PORT 7U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINSM2_M2_PWREN_PIN 23U                            /*!<@brief PORT pin number */
#define BOARD_INITPINSM2_M2_PWREN_PIN_MASK (1U << 23U)               /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PIO3_7 (coord H7), WL_RST
  @{ */
/* Routed pin properties */
#define BOARD_INITPINSM2_WL_RST_PERIPHERAL GPIO3                   /*!<@brief Peripheral name */
#define BOARD_INITPINSM2_WL_RST_SIGNAL IO                          /*!<@brief Signal name */
#define BOARD_INITPINSM2_WL_RST_CHANNEL 7                          /*!<@brief Signal channel */
#define BOARD_INITPINSM2_WL_RST_PORT 3U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINSM2_WL_RST_PIN 7U                             /*!<@brief PORT pin number */
#define BOARD_INITPINSM2_WL_RST_PIN_MASK (1U << 7U)                /*!<@brief PORT pin mask */
                                                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinsM2(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
